print("Робота із кортежами (tuple)")

# Кортежі (tuple) - це незмінні послідовності, 
# які можуть містити різні типи даних.
myTuple = (1, 2, 3, "Чотири", 5.0)
print(myTuple)

print(type(myTuple)) #виводить тип даних myTuple

# Доступ до елементів кортежу
print(myTuple[0]) #виводить перший елемент кортежу

try:
    myTuple[0] = 18 #у кортежах не можна змінювати елементи, тому це викличе помилку
except TypeError as e:
    print(f"Помилка: {e}")

print(f"Кількість елементів у кортежі: {len(myTuple)}") #виводить кількість елементів у кортежі

for item in myTuple:
    print("Елементи списку: Є ", item) #виводить кожен елемент кортежу

i=0
while(i<len(myTuple)):
    print(f"myTuple[{i}] = {myTuple[i]}") #виводить кожен елемент кортежу з його індексом
    i+=1